// Вивести в консоль всі числа від 1 до 10 за допомогою циклу while.

let f = 1;
while (f <= 10) {
    console.log(f);
    f++;
}



// Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. 
// Якщо число парне, пропустити його за допомогою continue.

for (let i = 2; i <= 20; i += 1) {
    if (i % 2 === 1) {
        continue;
    }
    console.log(i);
    
}



// Вивести в консоль таблицю множення числа 7 за допомогою циклу for.

for (let m = 1; m <= 10; m += 1) {
    console.log(7 * m);
}



// Створити скрипт, який виводить в консоль всі числа , які менші за n. 
// Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.
// let numbers = [3, 5, 23, 9, 8, 12];
// let n = 7;

let numbers = [3, 5, 23, 9, 8, 12];
let n = 7;
for (let l = 0; l < numbers.length; l++) {
    if (numbers[l] >= n) {
        break;
    }
    console.log(numbers[l]);
    
}



// За допомогою циклу while вивести в консоль всі числа від 1 до 20, крім чисел, кратних 3. 
// Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.


let j = 1;
while (j <= 20) {
  if (j % 3 === 0) {
    j++;
    continue;
  }
  console.log(j);
  j++;
}
